# GetMultipleValuesIndicationSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultipleValuesIndicationSettings..::..GetMultipleValuesIndicationSettings Method
MultipleValuesIndicationSettings Class See Also
---
Returns the MultipleValuesIndicationSettings element for a given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static MultipleValuesIndicationSettings GetMultipleValuesIndicationSettings(
	Document cda
)
```

Visual Basic
---
```text
Public Shared Function GetMultipleValuesIndicationSettings ( _
	cda As Document _
) As MultipleValuesIndicationSettings
```

Visual C++
---
```text
public:
static MultipleValuesIndicationSettings^ GetMultipleValuesIndicationSettings(
	Document^ cda
)
```

# ### Parameters
cda
    Type: Autodesk.Revit.DB..::..Document The document for which to get the MultipleValuesIndicationSettings element.
# ### Return Value
Returns the MultipleValuesIndicationSettings element in project documents or nullNothingnullptra null reference (Nothing in Visual Basic) for family documents
.
# Remarks
Project documents have a MultipleValuesIndicationSettings element, one per document. Family documents do not have MultipleValuesIndicationSettings elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace